spec/cassettes/SpreeMoneyBird_Invoice_create_invoice.yml

---
http_interactions:
- request:
    method: post
    uri: https://mail%2Bapi%40willian.io:<MONEYBIRD_PASSWORD>@<MONEYBIRD_COMPANY>.moneybird.nl/invoices.json
    body:
      encoding: UTF-8
      string: '{"invoice":{"contact_name_search":"Company","company_name":"Company","firstname":"John","lastname":"Doe","address1":"10
        Lovely Street","address2":"Northwest","zipcode":"35005","city":"Herndon","country":"United
        States of America","details_attributes":[{"description":"Product #18 - 5485","amount":1,"created_at":"2014-10-31T12:34:14.052Z","tax_rate_id":"455130","price":"10.0"},{"description":"Product
        #19 - 5471","amount":1,"created_at":"2014-10-31T12:34:14.133Z","tax_rate_id":"455130","price":"10.0"},{"description":"Product
        #20 - 1638","amount":1,"created_at":"2014-10-31T12:34:14.210Z","tax_rate_id":"455130","price":"10.0"},{"description":"Product
        #21 - 591","amount":1,"created_at":"2014-10-31T12:34:14.289Z","tax_rate_id":"455130","price":"10.0"},{"description":"Product
        #22 - 4524","amount":1,"created_at":"2014-10-31T12:34:14.363Z","tax_rate_id":"455130","price":"10.0"}],"contact_id":null}}'
    headers:
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 201
      message: Created
    headers:
      Server:
      - nginx
      Date:
      - Fri, 31 Oct 2014 12:34:15 GMT
      Content-Type:
      - application/json; charset=utf-8
      Status:
      - 201 Created
      Strict-Transport-Security:
      - max-age=31536000
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      Location:
      - https://<MONEYBIRD_COMPANY>.moneybird.nl/invoices/3726836
      X-Ratelimit-Limit:
      - '350'
      X-Ratelimit-Remaining:
      - '337'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Set-Cookie:
      - birdflight=a95a0b0f817d0747ac809996168ce8fbddd4088976ed3d7fa6da45a5fe07e0f840089e4d45d6f34beb08ce81affc731d0767b752e735678375353e953545a282;
        domain=.moneybird.nl; path=/; secure; HttpOnly
      X-Request-Id:
      - b2df210d44655e1099d15f1b05923745
      X-Runtime:
      - '0.514006'
      X-Powered-By:
      - Phusion Passenger
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Connection:
      - Keep-alive
    body:
      encoding: UTF-8
      string: '{"invoice":{"address1":"10 Lovely Street","address2":"Northwest","attention":null,"city":"Herndon","company_name":"Company","concept_id":261,"contact_id":2468642,"country":"United
        States of America","created_at":"2014-10-31T13:34:15+01:00","currency":"EUR","customer_id":"a619649e-e66e-41e5-a2d9-e1c64de934b5","description":"We
        verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price}
        voor {document.due_date} te voldoen op onze bankrekening onder vermelding
        van het factuurnummer {document.invoice_id}. Voor vragen kunt u contact opnemen
        per e-mail.","discount":"0.0","due_date_interval":14,"exchange_rate":1,"firstname":"John","id":3726836,"invoice_date":"2014-10-31","invoice_hash":"bde5dd0c80385847b3081cad00319ba794c09067","invoice_id":null,"invoice_profile_id":1,"invoice_profile_version_id":null,"language":"nl","lastname":"Doe","original_estimate_id":null,"original_invoice_id":null,"po_number":null,"prices_are_incl_tax":false,"recurring_template_id":null,"send_method":"email","sent_at":null,"sent_to_endpoint":null,"sent_via_si":false,"sepa_active":false,"show_customer_id":false,"show_tax":false,"show_tax_number":false,"si_delivered_at":null,"si_delivered_at_ap":null,"state":"draft","tax_number":null,"total_price_excl_tax":"50.0","total_price_excl_tax_base":"50.0","total_price_incl_tax":"50.0","total_price_incl_tax_base":"50.0","total_price_incl_tax_correction":"0.0","updated_at":"2014-10-31T13:34:15+01:00","use_default_attachment":true,"zipcode":"35005","contact_name":"John
        Doe","days_open":0,"email":"","invoice_email":"Geachte John Doe, \n\nIn de
        bijlage kunt u factuur {document.invoice_id} voor onze diensten vinden. Wij
        verzoeken u vriendelijk de factuur voor 14-11-2014 te voldoen.\n\nMet vriendelijke
        groet,\n\nwillian.dev","invoice_email_reminder":"Geachte John Doe, \n\nIn
        de bijlage kunt u een herinnering voor factuur {document.invoice_id} vinden.
        Deze factuur is op 14-11-2014 verlopen, maar helaas hebben wij nog geen betaling
        ontvangen. Wij verzoeken u vriendelijk de factuur binnen vijf dagen te voldoen.\n\nMet
        vriendelijke groet,\n\nwillian.dev","name":"Company","pay_url":"https://<MONEYBIRD_COMPANY>.moneybird.nl/invoice/4f6b6d5a3b81b22f6a57dfaeac9a290b5420fa94/bde5dd0c80385847b3081cad00319ba794c09067/pay","revision":1414758855,"sender_address":"<strong>willian.dev</strong><br
        />\nStraatnaam 12<br />\n1234AB Plaats<br />\n<br />\n<br />\ninfo@bedrijfsnaam.nl<br
        />\n<br />\n<br />\n<span class=\"caps\">KVK</span>: 12345678<br />\n<span
        class=\"caps\">BTW</span>: NL123456789B01<br />\nBank: ","tax_components":[],"total_discount":"-0.0","total_paid":0,"total_tax":0.0,"total_unpaid":"50.0","url":"https://<MONEYBIRD_COMPANY>.moneybird.nl/invoice/4f6b6d5a3b81b22f6a57dfaeac9a290b5420fa94/bde5dd0c80385847b3081cad00319ba794c09067","details":[{"amount":"1.0","created_at":"2014-10-31T13:34:15+01:00","description":"Product
        #18 - 5485","id":12890477,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:15+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"},{"amount":"1.0","created_at":"2014-10-31T13:34:15+01:00","description":"Product
        #19 - 5471","id":12890478,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:15+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"},{"amount":"1.0","created_at":"2014-10-31T13:34:15+01:00","description":"Product
        #20 - 1638","id":12890479,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:15+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"},{"amount":"1.0","created_at":"2014-10-31T13:34:15+01:00","description":"Product
        #21 - 591","id":12890480,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:15+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"},{"amount":"1.0","created_at":"2014-10-31T13:34:15+01:00","description":"Product
        #22 - 4524","id":12890481,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:15+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"}],"history":[{"action":"invoice_created","created_at":"2014-10-31T13:34:15+01:00","description":null,"email":null,"id":10330549,"updated_at":"2014-10-31T13:34:15+01:00","user_id":null}],"payments":[],"attachments":[],"transactions":[]}}'
    http_version: 
  recorded_at: Fri, 31 Oct 2014 12:34:15 GMT
recorded_with: VCR 2.9.2
