spec/cassettes/SpreeMoneyBird_Invoice_create_invoice_without_contact.yml

---
http_interactions:
- request:
    method: post
    uri: https://mail%2Bapi%40willian.io:<MONEYBIRD_PASSWORD>@<MONEYBIRD_COMPANY>.moneybird.nl/invoices.json
    body:
      encoding: UTF-8
      string: '{"invoice":{"contact_name_search":"Company","company_name":"Company","firstname":"John","lastname":"Doe","address1":"10
        Lovely Street","address2":"Northwest","zipcode":"35005","city":"Herndon","country":"United
        States of America","details_attributes":[{"description":"Product #3 - 5757","amount":1,"created_at":"2014-10-31T12:34:10.076Z","tax_rate_id":"455130","price":"10.0"},{"description":"Product
        #4 - 1483","amount":1,"created_at":"2014-10-31T12:34:10.158Z","tax_rate_id":"455130","price":"10.0"},{"description":"Product
        #5 - 2818","amount":1,"created_at":"2014-10-31T12:34:10.226Z","tax_rate_id":"455130","price":"10.0"},{"description":"Product
        #6 - 1725","amount":1,"created_at":"2014-10-31T12:34:10.300Z","tax_rate_id":"455130","price":"10.0"},{"description":"Product
        #7 - 2340","amount":1,"created_at":"2014-10-31T12:34:10.369Z","tax_rate_id":"455130","price":"10.0"}]}}'
    headers:
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 201
      message: Created
    headers:
      Server:
      - nginx
      Date:
      - Fri, 31 Oct 2014 12:34:11 GMT
      Content-Type:
      - application/json; charset=utf-8
      Status:
      - 201 Created
      Strict-Transport-Security:
      - max-age=31536000
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      Location:
      - https://<MONEYBIRD_COMPANY>.moneybird.nl/invoices/3726833
      X-Ratelimit-Limit:
      - '350'
      X-Ratelimit-Remaining:
      - '341'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Set-Cookie:
      - birdflight=f838668bb0b99b52051d32bbe524e38872e50d37f4f1d35589186817f56a9c2c1b24768897f27e867a08e2a7f3350364e36a55ca650dee1780d177444ccd674c;
        domain=.moneybird.nl; path=/; secure; HttpOnly
      X-Request-Id:
      - dda0a66ff7cbc0285635c8fe3477bcf0
      X-Runtime:
      - '0.356950'
      X-Powered-By:
      - Phusion Passenger
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Connection:
      - Keep-alive
    body:
      encoding: UTF-8
      string: '{"invoice":{"address1":"10 Lovely Street","address2":"Northwest","attention":null,"city":"Herndon","company_name":"Company","concept_id":259,"contact_id":2468639,"country":"United
        States of America","created_at":"2014-10-31T13:34:11+01:00","currency":"EUR","customer_id":"cd3b43ce-783b-4b9a-b3e7-3335a1c51e0e","description":"We
        verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price}
        voor {document.due_date} te voldoen op onze bankrekening onder vermelding
        van het factuurnummer {document.invoice_id}. Voor vragen kunt u contact opnemen
        per e-mail.","discount":"0.0","due_date_interval":14,"exchange_rate":1,"firstname":"John","id":3726833,"invoice_date":"2014-10-31","invoice_hash":"99c5e05ed3feab3ef259595e73df97f5ca0431d4","invoice_id":null,"invoice_profile_id":1,"invoice_profile_version_id":null,"language":"nl","lastname":"Doe","original_estimate_id":null,"original_invoice_id":null,"po_number":null,"prices_are_incl_tax":false,"recurring_template_id":null,"send_method":"email","sent_at":null,"sent_to_endpoint":null,"sent_via_si":false,"sepa_active":false,"show_customer_id":false,"show_tax":false,"show_tax_number":false,"si_delivered_at":null,"si_delivered_at_ap":null,"state":"draft","tax_number":null,"total_price_excl_tax":"50.0","total_price_excl_tax_base":"50.0","total_price_incl_tax":"50.0","total_price_incl_tax_base":"50.0","total_price_incl_tax_correction":"0.0","updated_at":"2014-10-31T13:34:11+01:00","use_default_attachment":true,"zipcode":"35005","contact_name":"John
        Doe","days_open":0,"email":"","invoice_email":"Geachte John Doe, \n\nIn de
        bijlage kunt u factuur {document.invoice_id} voor onze diensten vinden. Wij
        verzoeken u vriendelijk de factuur voor 14-11-2014 te voldoen.\n\nMet vriendelijke
        groet,\n\nwillian.dev","invoice_email_reminder":"Geachte John Doe, \n\nIn
        de bijlage kunt u een herinnering voor factuur {document.invoice_id} vinden.
        Deze factuur is op 14-11-2014 verlopen, maar helaas hebben wij nog geen betaling
        ontvangen. Wij verzoeken u vriendelijk de factuur binnen vijf dagen te voldoen.\n\nMet
        vriendelijke groet,\n\nwillian.dev","name":"Company","pay_url":"https://<MONEYBIRD_COMPANY>.moneybird.nl/invoice/39c245a4017397fb84bf486e2856a62f0c656a0d/99c5e05ed3feab3ef259595e73df97f5ca0431d4/pay","revision":1414758851,"sender_address":"<strong>willian.dev</strong><br
        />\nStraatnaam 12<br />\n1234AB Plaats<br />\n<br />\n<br />\ninfo@bedrijfsnaam.nl<br
        />\n<br />\n<br />\n<span class=\"caps\">KVK</span>: 12345678<br />\n<span
        class=\"caps\">BTW</span>: NL123456789B01<br />\nBank: ","tax_components":[],"total_discount":"-0.0","total_paid":0,"total_tax":0.0,"total_unpaid":"50.0","url":"https://<MONEYBIRD_COMPANY>.moneybird.nl/invoice/39c245a4017397fb84bf486e2856a62f0c656a0d/99c5e05ed3feab3ef259595e73df97f5ca0431d4","details":[{"amount":"1.0","created_at":"2014-10-31T13:34:11+01:00","description":"Product
        #3 - 5757","id":12890465,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:11+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"},{"amount":"1.0","created_at":"2014-10-31T13:34:11+01:00","description":"Product
        #4 - 1483","id":12890466,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:11+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"},{"amount":"1.0","created_at":"2014-10-31T13:34:11+01:00","description":"Product
        #5 - 2818","id":12890467,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:11+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"},{"amount":"1.0","created_at":"2014-10-31T13:34:11+01:00","description":"Product
        #6 - 1725","id":12890468,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:11+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"},{"amount":"1.0","created_at":"2014-10-31T13:34:11+01:00","description":"Product
        #7 - 2340","id":12890469,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":455130,"updated_at":"2014-10-31T13:34:11+01:00","amount_plain":1,"tax":0,"total_price_excl_tax":"10.0","total_price_incl_tax":"10.0"}],"history":[{"action":"invoice_created","created_at":"2014-10-31T13:34:11+01:00","description":null,"email":null,"id":10330545,"updated_at":"2014-10-31T13:34:11+01:00","user_id":null}],"payments":[],"attachments":[],"transactions":[]}}'
    http_version: 
  recorded_at: Fri, 31 Oct 2014 12:34:11 GMT
recorded_with: VCR 2.9.2
