spec/cassettes/SpreeMoneyBird_Invoice_send_invoice.yml

---
http_interactions:
- request:
    method: get
    uri: https://mail%2Bapi%40willian.io:<MONEYBIRD_PASSWORD>@<MONEYBIRD_COMPANY>.moneybird.nl/invoices/3223779.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 30 Jul 2014 13:02:13 GMT
      Content-Type:
      - application/json; charset=utf-8
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Ratelimit-Limit:
      - '350'
      X-Ratelimit-Remaining:
      - '343'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Set-Cookie:
      - birdflight=4d1750c774d8e3b1d4d98c09f8314f8cc1749fa573be3fcb90dd79403e31cc7828ee37d710a5740faee0eab2371a7e9c8c70b0ef4534af642eff6a8a18d20089;
        domain=.moneybird.nl; path=/; secure; HttpOnly
      X-Request-Id:
      - 4ce40caa9262a0affc36cd82fa8bc666
      X-Runtime:
      - '0.145491'
      X-Powered-By:
      - Phusion Passenger
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Connection:
      - Keep-alive
    body:
      encoding: US-ASCII
      string: ! '{"invoice":{"address1":"10 Lovely Street","address2":"Northwest","attention":null,"city":"Herndon","company_name":"Company","concept_id":226,"contact_id":2196551,"country":"UNITED
        STATES","created_at":"2014-07-30T15:02:10+02:00","currency":"EUR","customer_id":"2c20624a-b59a-4bd6-9aa4-4c7c2b7e0668","description":"We
        verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price}
        voor {document.due_date} te voldoen op onze bankrekening onder vermelding
        van het factuurnummer {document.invoice_id}. Voor vragen kunt u contact opnemen
        per e-mail.","discount":"0.0","due_date_interval":14,"exchange_rate":1,"firstname":"John","id":3223779,"invoice_date":"2014-07-30","invoice_hash":"fbd8fbe234cbdeb4dbbedccc431fb4aac1d6ba1e","invoice_id":null,"invoice_profile_id":1,"invoice_profile_version_id":null,"language":"nl","lastname":"Doe","original_estimate_id":null,"original_invoice_id":null,"po_number":null,"prices_are_incl_tax":false,"recurring_template_id":null,"send_method":"email","sepa_active":false,"show_customer_id":false,"show_tax":true,"show_tax_number":false,"state":"draft","tax_number":null,"total_price_excl_tax":"150.0","total_price_excl_tax_base":"150.0","total_price_incl_tax":"181.5","total_price_incl_tax_base":"181.5","updated_at":"2014-07-30T15:02:10+02:00","zipcode":"35005","contact_name":"John
        Doe","days_open":0,"email":"","invoice_email":"Geachte John Doe, \n\nIn de
        bijlage kunt u factuur {document.invoice_id} voor onze diensten vinden. Wij
        verzoeken u vriendelijk de factuur voor 13-08-2014 te voldoen.\n\nMet vriendelijke
        groet,\n\nwillian.dev","invoice_email_reminder":"Geachte John Doe, \n\nIn
        de bijlage kunt u een herinnering voor factuur {document.invoice_id} vinden.
        Deze factuur is op 13-08-2014 verlopen, maar helaas hebben wij nog geen betaling
        ontvangen. Wij verzoeken u vriendelijk de factuur binnen vijf dagen te voldoen.\n\nMet
        vriendelijke groet,\n\nwillian.dev","name":"Company","pay_url":"https://<MONEYBIRD_COMPANY>.moneybird.nl/invoice/5c5330456b7b7b8b1079f8849ba30c356796ec28/fbd8fbe234cbdeb4dbbedccc431fb4aac1d6ba1e/pay","revision":1406725330,"sender_address":"<strong>willian.dev</strong><br
        />\nStraatnaam 12<br />\n1234AB Plaats<br />\n<br />\n<br />\ninfo@bedrijfsnaam.nl<br
        />\n<br />\n<br />\n<span class=\"caps\">KVK</span>: 12345678<br />\n<span
        class=\"caps\">BTW</span>: NL123456789B01<br />\nBank: ","tax_components":[{"percentage":"0.21","tax_amount":"31.5","amount":"150.0","report_reference":"NL/1a"}],"total_discount":"-0.0","total_paid":0,"total_tax":"31.5","total_unpaid":"181.5","url":"https://<MONEYBIRD_COMPANY>.moneybird.nl/invoice/5c5330456b7b7b8b1079f8849ba30c356796ec28/fbd8fbe234cbdeb4dbbedccc431fb4aac1d6ba1e","details":[{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #11 - 1160","id":11095418,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #12 - 8675","id":11095419,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #13 - 830","id":11095420,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #14 - 1610","id":11095421,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #15 - 1992","id":11095422,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":1,"created_at":"2014-07-30T15:02:10+02:00","description":"Verzending","id":11095424,"ledger_account_id":1081089,"price":"100.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"","tax":"0.21","total_price_excl_tax":"100.0","total_price_incl_tax":"121.0"}],"history":[{"action":"invoice_created","created_at":"2014-07-30T15:02:10+02:00","description":null,"email":null,"id":8951283,"updated_at":"2014-07-30T15:02:10+02:00","user_id":null}],"payments":[],"attachments":[]}}'
    http_version: 
  recorded_at: Wed, 30 Jul 2014 13:02:12 GMT
- request:
    method: put
    uri: https://mail%2Bapi%40willian.io:<MONEYBIRD_PASSWORD>@<MONEYBIRD_COMPANY>.moneybird.nl/invoices/3223779/send_invoice.json
    body:
      encoding: US-ASCII
      string: ! '{"invoice":{"email":"mrwhite@example.com","send_method":"hand"}}'
    headers:
      Content-Type:
      - application/json
      Accept:
      - ! '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 30 Jul 2014 13:02:13 GMT
      Content-Type:
      - application/json; charset=utf-8
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      Location:
      - https://<MONEYBIRD_COMPANY>.moneybird.nl/invoices/3223779
      X-Ratelimit-Limit:
      - '350'
      X-Ratelimit-Remaining:
      - '342'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Set-Cookie:
      - birdflight=2acad71cdf1e6508749933e55b9e1e41e0dbff414974f58b7c60215a6b45be9b7761840a8f3c892e389abe61158476fa85809c50b4a61de758188bb59135ed26;
        domain=.moneybird.nl; path=/; secure; HttpOnly
      X-Request-Id:
      - 32e9d7f4fdf88922a85714bb12fd4160
      X-Runtime:
      - '0.379671'
      X-Powered-By:
      - Phusion Passenger
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Connection:
      - Keep-alive
    body:
      encoding: US-ASCII
      string: ! '{"invoice":{"address1":"10 Lovely Street","address2":"Northwest","attention":null,"city":"Herndon","company_name":"Company","concept_id":null,"contact_id":2196551,"country":"UNITED
        STATES","created_at":"2014-07-30T15:02:10+02:00","currency":"EUR","customer_id":"2c20624a-b59a-4bd6-9aa4-4c7c2b7e0668","description":"We
        verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price}
        voor {document.due_date} te voldoen op onze bankrekening onder vermelding
        van het factuurnummer {document.invoice_id}. Voor vragen kunt u contact opnemen
        per e-mail.","discount":"0.0","due_date_interval":14,"exchange_rate":"1.0","firstname":"John","id":3223779,"invoice_date":"2014-07-30","invoice_hash":"fbd8fbe234cbdeb4dbbedccc431fb4aac1d6ba1e","invoice_id":"2014-0091","invoice_profile_id":1,"invoice_profile_version_id":1,"language":"nl","lastname":"Doe","original_estimate_id":null,"original_invoice_id":null,"po_number":null,"prices_are_incl_tax":false,"recurring_template_id":null,"send_method":"hand","sepa_active":false,"show_customer_id":false,"show_tax":true,"show_tax_number":false,"state":"open","tax_number":null,"total_price_excl_tax":"150.0","total_price_excl_tax_base":"150.0","total_price_incl_tax":"181.5","total_price_incl_tax_base":"181.5","updated_at":"2014-07-30T15:02:13+02:00","zipcode":"35005","contact_name":"John
        Doe","days_open":0,"email":"mrwhite@example.com","invoice_email":"Geachte
        John Doe, \n\nIn de bijlage kunt u factuur 2014-0091 voor onze diensten vinden.
        Wij verzoeken u vriendelijk de factuur voor 13-08-2014 te voldoen.\n\nMet
        vriendelijke groet,\n\nwillian.dev","invoice_email_reminder":"Geachte John
        Doe, \n\nIn de bijlage kunt u een herinnering voor factuur 2014-0091 vinden.
        Deze factuur is op 13-08-2014 verlopen, maar helaas hebben wij nog geen betaling
        ontvangen. Wij verzoeken u vriendelijk de factuur binnen vijf dagen te voldoen.\n\nMet
        vriendelijke groet,\n\nwillian.dev","name":"Company","pay_url":"https://<MONEYBIRD_COMPANY>.moneybird.nl/invoice/5c5330456b7b7b8b1079f8849ba30c356796ec28/fbd8fbe234cbdeb4dbbedccc431fb4aac1d6ba1e/pay","revision":1406725333,"sender_address":"<strong>willian.dev</strong><br
        />\nStraatnaam 12<br />\n1234AB Plaats<br />\n<br />\n<br />\ninfo@bedrijfsnaam.nl<br
        />\n<br />\n<br />\n<span class=\"caps\">KVK</span>: 12345678<br />\n<span
        class=\"caps\">BTW</span>: NL123456789B01<br />\nBank: ","tax_components":[{"percentage":"0.21","tax_amount":"31.5","amount":"150.0","report_reference":"NL/1a"}],"total_discount":"-0.0","total_paid":0,"total_tax":"31.5","total_unpaid":"181.5","url":"https://<MONEYBIRD_COMPANY>.moneybird.nl/invoice/5c5330456b7b7b8b1079f8849ba30c356796ec28/fbd8fbe234cbdeb4dbbedccc431fb4aac1d6ba1e","details":[{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #11 - 1160","id":11095418,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #12 - 8675","id":11095419,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #13 - 830","id":11095420,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #14 - 1610","id":11095421,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":"1.0","created_at":"2014-07-30T15:02:10+02:00","description":"Product
        #15 - 1992","id":11095422,"ledger_account_id":1081089,"price":"10.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"1","tax":"0.21","total_price_excl_tax":"10.0","total_price_incl_tax":"12.1"},{"amount":1,"created_at":"2014-07-30T15:02:10+02:00","description":"Verzending","id":11095424,"ledger_account_id":1081089,"price":"100.0","row_order":null,"tax_rate_id":411954,"updated_at":"2014-07-30T15:02:10+02:00","amount_plain":"","tax":"0.21","total_price_excl_tax":"100.0","total_price_incl_tax":"121.0"}],"history":[{"action":"invoice_created","created_at":"2014-07-30T15:02:10+02:00","description":null,"email":null,"id":8951283,"updated_at":"2014-07-30T15:02:10+02:00","user_id":null},{"action":"invoice_sent_hand","created_at":"2014-07-30T15:02:13+02:00","description":"","email":"Geachte
        John Doe, \n\nIn de bijlage kunt u factuur 2014-0091 voor onze diensten vinden.
        Wij verzoeken u vriendelijk de factuur voor 13-08-2014 te voldoen.\n\nMet
        vriendelijke groet,\n\nwillian.dev","id":8951284,"updated_at":"2014-07-30T15:02:13+02:00","user_id":null}],"payments":[],"attachments":[]}}'
    http_version: 
  recorded_at: Wed, 30 Jul 2014 13:02:13 GMT
recorded_with: VCR 2.9.2
